In [5]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame({"var1": [1,5,2,8,0,4],
                   "var2": [4,3,6,8,3,2]})

In [11]:
df

   var1  var2
0     1     4
1     5     3
2     2     6
3     8     8
4     0     3
5     4     2

In [12]:
df.apply(np.sum)

var1    20
var2    26
dtype: int64

In [13]:
df.apply(np.mean)

var1    3.333333
var2    4.333333
dtype: float64

In [14]:
df = pd.DataFrame({"groups": ["a", "b", "c", "a", "b", "c"],
                   "var1": [1,5,2,8,0,4],
                   "var2": [4,3,6,8,3,2]})

In [15]:
df

  groups  var1  var2
0      a     1     4
1      b     5     3
2      c     2     6
3      a     8     8
4      b     0     3
5      c     4     2

In [20]:
df.groupby("groups").apply(np.sum, axis=0)

/var/folders/rx/xk61zj3118j0d4ksj4gtp1ym0000gn/T/ipykernel_95259/191387769.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("groups").apply(np.sum, axis=0)

       groups  var1  var2
groups
a          aa     9    12
b          bb     5     6
c          cc     6     8

In [21]:
df.groupby("groups").apply(np.mean, axis=0)

        var1  var2
groups
a        4.5   6.0
b        2.5   3.0
c        3.0   4.0